In [71]:
names=["Tom치s", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

In [2]:
education #testing

['Bach', 'Bach', 'Master', 'PhD', 'Bach', 'Master']

In [4]:
import pandas
from pandas import DataFrame

In [72]:
data = {'names': names, 'woman': woman, 'ages': ages, 'country': country, 'education': education}

In [8]:
data

{'names': ['Tom치s', 'Pauline', 'Pablo', 'Bjork', 'Alan', 'Juana'],
 'woman': [False, True, False, False, False, True],
 'ages': [32, 33, 28, 30, 32, 27],
 'country': ['Chile', 'Senegal', 'Spain', 'Norway', 'Peru', 'Peru'],
 'education': ['Bach', 'Bach', 'Master', 'PhD', 'Bach', 'Master']}

In [73]:
friends = DataFrame.from_dict(data)

In [74]:
friends

     names  woman  ages  country education
0    Tom치s  False    32    Chile      Bach
1  Pauline   True    33  Senegal      Bach
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
4     Alan  False    32     Peru      Bach
5    Juana   True    27     Peru    Master

In [15]:
# Who is the oldest person in this group of friends?
friends[friends.ages == max(friends.ages)]

     names  woman  ages  country education
1  Pauline   True    33  Senegal      Bach

In [21]:
# How many people are 32?
len(friends[friends.ages == 32])




#c. Do some research and find the answer using query() and min()

#Solve this in a new Jupyter notebook, and then upload it to GitHub. Name the notebook as 'hw_data_structures'.

2

In [22]:
# How many are not Peruvian? (use two different codes)
len(friends[friends.country == 'Peru'])

2

In [26]:
# Who is the person with the highest level of education?
friends[friends.education == 'PhD']

   names  woman  ages country education
3  Bjork  False    30  Norway       PhD

In [48]:
# what is the sex of the oldest person in the group?
friends[friends.ages == max(friends.ages)].woman

1    True
Name: woman, dtype: bool

In [128]:
### Homework

# If you have the query:

# where is the youngest male in the group from?

# my own answer
male = friends[(friends.woman == False)] 
male[male.ages == min(male.ages)]

   names  woman  ages country education
2  Pablo  False    28   Spain    Master

In [127]:
#a. Find the answer using sort_values()
male.sort_values('ages', ascending=True).head(1)

   names  woman  ages country education
2  Pablo  False    28   Spain    Master

In [121]:
#b. Do some research and find the answer using where() and min()
male.where(male.ages == min(male.ages))

   names  woman  ages country education
0    NaN    NaN   NaN     NaN       NaN
2  Pablo    0.0  28.0   Spain    Master
3    NaN    NaN   NaN     NaN       NaN
4    NaN    NaN   NaN     NaN       NaN

     names  woman  ages  country education
0    Tom치s  False    32    Chile      Bach
1  Pauline   True    33  Senegal      Bach
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
4     Alan  False    32     Peru      Bach
5    Juana   True    27     Peru    Master